In [19]:
import pandas as pd
a=({
    "name":["john","janny","orry"],
    "age":[20,30,20],
    "doj":["22/05/24","13/01/22","10/03/23"],
    "time":["9:00","10:00","11:00"]
}) 
data=pd.DataFrame(a)
data

    name  age       doj   time
0   john   20  22/05/24   9:00
1  janny   30  13/01/22  10:00
2   orry   20  10/03/23  11:00

In [15]:
pd.to_datetime(data['doj'])

C:\Users\win10\AppData\Local\Temp\ipykernel_4832\4272561337.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(data['doj'])

0   2024-05-22
1   2022-01-13
2   2023-10-03
Name: doj, dtype: datetime64[ns]

In [20]:
data['day'] = pd.to_datetime(data['doj']).dt.day
data

C:\Users\win10\AppData\Local\Temp\ipykernel_4832\1599079503.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  data['day'] = pd.to_datetime(data['doj']).dt.day

    name  age       doj   time  day
0   john   20  22/05/24   9:00   22
1  janny   30  13/01/22  10:00   13
2   orry   20  10/03/23  11:00    3

In [21]:
data['month'] = pd.to_datetime(data['doj']).dt.month
data

C:\Users\win10\AppData\Local\Temp\ipykernel_4832\2027041318.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  data['month'] = pd.to_datetime(data['doj']).dt.month

    name  age       doj   time  day  month
0   john   20  22/05/24   9:00   22      5
1  janny   30  13/01/22  10:00   13      1
2   orry   20  10/03/23  11:00    3     10

In [22]:
data['year'] = pd.to_datetime(data['doj']).dt.year
data

C:\Users\win10\AppData\Local\Temp\ipykernel_4832\2761708752.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  data['year'] = pd.to_datetime(data['doj']).dt.year

    name  age       doj   time  day  month  year
0   john   20  22/05/24   9:00   22      5  2024
1  janny   30  13/01/22  10:00   13      1  2022
2   orry   20  10/03/23  11:00    3     10  2023

In [24]:
data.set_index(pd.to_datetime(data['doj']))

C:\Users\win10\AppData\Local\Temp\ipykernel_4832\1510361957.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  data.set_index(pd.to_datetime(data['doj']))

             name  age       doj   time  day  month  year
doj
2024-05-22   john   20  22/05/24   9:00   22      5  2024
2022-01-13  janny   30  13/01/22  10:00   13      1  2022
2023-10-03   orry   20  10/03/23  11:00    3     10  2023

In [28]:
data["name"].str.len()

0    4
1    5
2    4
Name: name, dtype: int64

In [32]:
data['name'].replace({'john':'tobin'})
data

    name  age       doj   time  day  month  year empname
0  tobin   20  22/05/24   9:00   22      5  2024   tobin
1  janny   30  13/01/22  10:00   13      1  2022   janny
2   orry   20  10/03/23  11:00    3     10  2023    orry